apache-jmeter-5.5/bin/jmeter.log
2023-01-31 14:31:01,748 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2023-01-31 14:31:01,758 INFO o.a.j.JMeter: Loading user properties from: user.properties
2023-01-31 14:31:01,759 INFO o.a.j.JMeter: Loading system properties from: system.properties
2023-01-31 14:31:01,761 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2023-01-31 14:31:01,761 INFO o.a.j.JMeter: Version 5.5
2023-01-31 14:31:01,761 INFO o.a.j.JMeter: java.version=19.0.1
2023-01-31 14:31:01,761 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2023-01-31 14:31:01,761 INFO o.a.j.JMeter: os.name=Mac OS X
2023-01-31 14:31:01,761 INFO o.a.j.JMeter: os.arch=aarch64
2023-01-31 14:31:01,761 INFO o.a.j.JMeter: os.version=13.1
2023-01-31 14:31:01,761 INFO o.a.j.JMeter: file.encoding=UTF-8
2023-01-31 14:31:01,761 INFO o.a.j.JMeter: java.awt.headless=true
2023-01-31 14:31:01,762 INFO o.a.j.JMeter: Max memory     =1073741824
2023-01-31 14:31:01,762 INFO o.a.j.JMeter: Available Processors =10
2023-01-31 14:31:01,766 INFO o.a.j.JMeter: Default Locale=English (EN)
2023-01-31 14:31:01,766 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2023-01-31 14:31:01,766 INFO o.a.j.JMeter: JMeterHome=/Users/ssamal/Downloads/JMeter/apache-jmeter-5.5
2023-01-31 14:31:01,766 INFO o.a.j.JMeter: user.dir  =/Users/ssamal/Downloads/JMeter/apache-jmeter-5.5/bin
2023-01-31 14:31:01,766 INFO o.a.j.JMeter: PWD       =/Users/ssamal/Downloads/JMeter/apache-jmeter-5.5/bin
2023-01-31 14:31:01,768 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: AIPL7905LT16755.local FullName: localhost
2023-01-31 14:31:01,772 INFO o.a.j.s.FileServer: Default base='/Users/ssamal/Downloads/JMeter/apache-jmeter-5.5/bin'
2023-01-31 14:31:01,772 INFO o.a.j.s.FileServer: Set new base='/Users/ssamal/Downloads/JMeter/apache-jmeter-5.5/Scripts'
2023-01-31 14:31:01,867 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2023-01-31 14:31:01,881 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2023-01-31 14:31:01,883 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2023-01-31 14:31:01,884 INFO o.a.j.s.SaveService: Loading file: /Users/ssamal/Downloads/JMeter/apache-jmeter-5.5/Scripts/PRODUCT_STYLE_MASTER_AVRO.jmx
2023-01-31 14:31:01,917 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2023-01-31 14:31:01,917 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2023-01-31 14:31:01,917 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2023-01-31 14:31:01,917 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2023-01-31 14:31:01,922 INFO o.a.j.JMeter: Creating summariser <summary>
2023-01-31 14:31:01,927 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2023-01-31 14:31:01,927 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-01-31 14:31:01,927 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-01-31 14:31:01,929 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2023-01-31 14:31:01,929 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2023-01-31 14:31:01,974 INFO o.a.j.t.TestPlan: added /Users/ssamal/Downloads/JMeter/apache-jmeter-5.5/lib/ext/JMeter-InfluxDB-Writer-plugin-1.2.jar to classpath
2023-01-31 14:31:01,974 INFO o.a.j.t.TestPlan: added /Users/ssamal/Downloads/JMeter/apache-jmeter-5.5/lib/ext/kloadgen-5.2.7.jar to classpath
2023-01-31 14:31:02,085 INFO o.a.j.v.b.BackendListener: Backend Listener: Starting worker with class: class rocks.nt.apm.jmeter.JMeterInfluxDBBackendListenerClient and queue capacity: 5000
2023-01-31 14:31:02,086 INFO o.a.j.v.b.BackendListener: Backend Listener: Started  worker with class: class rocks.nt.apm.jmeter.JMeterInfluxDBBackendListenerClient
2023-01-31 14:31:02,194 INFO o.a.j.JMeter: Running test (1675155662194)
2023-01-31 14:31:02,207 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Setup - Thread Group
2023-01-31 14:31:02,207 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Setup - Thread Group.
2023-01-31 14:31:02,207 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-01-31 14:31:02,207 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2023-01-31 14:31:02,209 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2023-01-31 14:31:02,209 INFO o.a.j.e.StandardJMeterEngine: Waiting for thread group: Setup - Thread Group to finish before starting next group
2023-01-31 14:31:02,210 INFO o.a.j.t.JMeterThread: Thread started: Setup - Thread Group 1-1
2023-01-31 14:31:02,554 INFO o.a.k.c.p.ProducerConfig: ProducerConfig values: 
	acks = -1
	batch.size = 16384
	bootstrap.servers = [pkc-4rz0k.us-east-1.aws.confluent.cloud:9092]
	buffer.memory = 33554432
	client.dns.lookup = use_all_dns_ips
	client.id = producer-1
	compression.type = none
	connections.max.idle.ms = 540000
	delivery.timeout.ms = 120000
	enable.idempotence = true
	interceptor.classes = []
	key.serializer = class org.apache.kafka.common.serialization.StringSerializer
	linger.ms = 0
	max.block.ms = 60000
	max.in.flight.requests.per.connection = 5
	max.request.size = 1048576
	metadata.max.age.ms = 300000
	metadata.max.idle.ms = 300000
	metric.reporters = []
	metrics.num.samples = 2
	metrics.recording.level = INFO
	metrics.sample.window.ms = 30000
	partitioner.adaptive.partitioning.enable = true
	partitioner.availability.timeout.ms = 0
	partitioner.class = null
	partitioner.ignore.keys = false
	receive.buffer.bytes = 32768
	reconnect.backoff.max.ms = 1000
	reconnect.backoff.ms = 50
	request.timeout.ms = 30000
	retries = 2147483647
	retry.backoff.ms = 100
	sasl.client.callback.handler.class = null
	sasl.jaas.config = [hidden]
	sasl.kerberos.kinit.cmd = /usr/bin/kinit
	sasl.kerberos.min.time.before.relogin = 60000
	sasl.kerberos.service.name = null
	sasl.kerberos.ticket.renew.jitter = 0.05
	sasl.kerberos.ticket.renew.window.factor = 0.8
	sasl.login.callback.handler.class = null
	sasl.login.class = null
	sasl.login.connect.timeout.ms = null
	sasl.login.read.timeout.ms = null
	sasl.login.refresh.buffer.seconds = 300
	sasl.login.refresh.min.period.seconds = 60
	sasl.login.refresh.window.factor = 0.8
	sasl.login.refresh.window.jitter = 0.05
	sasl.login.retry.backoff.max.ms = 10000
	sasl.login.retry.backoff.ms = 100
	sasl.mechanism = PLAIN
	sasl.oauthbearer.clock.skew.seconds = 30
	sasl.oauthbearer.expected.audience = null
	sasl.oauthbearer.expected.issuer = null
	sasl.oauthbearer.jwks.endpoint.refresh.ms = 3600000
	sasl.oauthbearer.jwks.endpoint.retry.backoff.max.ms = 10000
	sasl.oauthbearer.jwks.endpoint.retry.backoff.ms = 100
	sasl.oauthbearer.jwks.endpoint.url = null
	sasl.oauthbearer.scope.claim.name = scope
	sasl.oauthbearer.sub.claim.name = sub
	sasl.oauthbearer.token.endpoint.url = null
	security.protocol = SASL_SSL
	security.providers = null
	send.buffer.bytes = 131072
	socket.connection.setup.timeout.max.ms = 30000
	socket.connection.setup.timeout.ms = 10000
	ssl.cipher.suites = null
	ssl.enabled.protocols = [TLSv1.2, TLSv1.3]
	ssl.endpoint.identification.algorithm = https
	ssl.engine.factory.class = null
	ssl.key.password = null
	ssl.keymanager.algorithm = SunX509
	ssl.keystore.certificate.chain = null
	ssl.keystore.key = null
	ssl.keystore.location = null
	ssl.keystore.password = null
	ssl.keystore.type = JKS
	ssl.protocol = TLSv1.3
	ssl.provider = null
	ssl.secure.random.implementation = null
	ssl.trustmanager.algorithm = PKIX
	ssl.truststore.certificates = null
	ssl.truststore.location = null
	ssl.truststore.password = null
	ssl.truststore.type = JKS
	transaction.timeout.ms = 60000
	transactional.id = null
	value.serializer = class io.confluent.kafka.serializers.KafkaAvroSerializer

2023-01-31 14:31:02,569 INFO i.c.k.s.KafkaAvroSerializerConfig: KafkaAvroSerializerConfig values: 
	auto.register.schemas = false
	avro.reflection.allow.null = false
	avro.remove.java.properties = false
	avro.use.logical.type.converters = false
	basic.auth.credentials.source = USER_INFO
	basic.auth.user.info = [hidden]
	bearer.auth.credentials.source = STATIC_TOKEN
	bearer.auth.token = [hidden]
	context.name.strategy = class io.confluent.kafka.serializers.context.NullContextNameStrategy
	id.compatibility.strict = true
	key.subject.name.strategy = class io.confluent.kafka.serializers.subject.TopicNameStrategy
	latest.compatibility.strict = true
	max.schemas.per.subject = 1000
	normalize.schemas = false
	proxy.host = 
	proxy.port = -1
	schema.reflection = false
	schema.registry.basic.auth.user.info = [hidden]
	schema.registry.ssl.cipher.suites = null
	schema.registry.ssl.enabled.protocols = [TLSv1.2, TLSv1.3]
	schema.registry.ssl.endpoint.identification.algorithm = https
	schema.registry.ssl.engine.factory.class = null
	schema.registry.ssl.key.password = null
	schema.registry.ssl.keymanager.algorithm = SunX509
	schema.registry.ssl.keystore.certificate.chain = null
	schema.registry.ssl.keystore.key = null
	schema.registry.ssl.keystore.location = null
	schema.registry.ssl.keystore.password = null
	schema.registry.ssl.keystore.type = JKS
	schema.registry.ssl.protocol = TLSv1.3
	schema.registry.ssl.provider = null
	schema.registry.ssl.secure.random.implementation = null
	schema.registry.ssl.trustmanager.algorithm = PKIX
	schema.registry.ssl.truststore.certificates = null
	schema.registry.ssl.truststore.location = null
	schema.registry.ssl.truststore.password = null
	schema.registry.ssl.truststore.type = JKS
	schema.registry.url = [https://psrc-q25x7.us-east-2.aws.confluent.cloud]
	use.latest.version = false
	use.schema.id = -1
	value.subject.name.strategy = class io.confluent.kafka.serializers.subject.TopicNameStrategy

2023-01-31 14:31:02,636 INFO o.a.k.c.p.KafkaProducer: [Producer clientId=producer-1] Instantiated an idempotent producer.
2023-01-31 14:31:02,725 INFO o.a.k.c.s.a.AbstractLogin: Successfully logged in.
2023-01-31 14:31:02,742 INFO o.a.k.c.u.AppInfoParser: Kafka version: 3.3.1
2023-01-31 14:31:02,742 INFO o.a.k.c.u.AppInfoParser: Kafka commitId: e23c59d00e687ff5
2023-01-31 14:31:02,742 INFO o.a.k.c.u.AppInfoParser: Kafka startTimeMs: 1675155662741
2023-01-31 14:31:02,745 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    1.8/s Avg:   533 Min:   533 Max:   533 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2023-01-31 14:31:02,745 INFO o.a.j.t.JMeterThread: Thread is done: Setup - Thread Group 1-1
2023-01-31 14:31:02,745 INFO o.a.j.t.JMeterThread: Thread finished: Setup - Thread Group 1-1
2023-01-31 14:31:02,745 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 2 : Iterator - Thread Group
2023-01-31 14:31:02,745 INFO o.a.j.e.StandardJMeterEngine: Starting 2 threads for group Iterator - Thread Group.
2023-01-31 14:31:02,745 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-01-31 14:31:02,745 INFO o.a.j.t.ThreadGroup: Starting thread group... number=2 threads=2 ramp-up=1 delayedStart=false
2023-01-31 14:31:02,746 INFO o.a.j.t.ThreadGroup: Started thread group number 2
2023-01-31 14:31:02,746 INFO o.a.j.e.StandardJMeterEngine: Waiting for thread group: Iterator - Thread Group to finish before starting next group
2023-01-31 14:31:02,746 INFO o.a.j.t.JMeterThread: Thread started: Iterator - Thread Group 2-1
2023-01-31 14:31:02,858 INFO o.a.j.p.j.s.J.Send Record - PRODUCT_STYLE_MASTER: PERFTEST_54773
2023-01-31 14:31:03,251 INFO o.a.j.t.JMeterThread: Thread started: Iterator - Thread Group 2-2
2023-01-31 14:31:03,281 INFO o.a.j.p.j.s.J.Send Record - PRODUCT_STYLE_MASTER: PERFTEST_80407
2023-01-31 14:31:05,268 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-0 to 132 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,269 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-5 to 40 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,269 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-2 to 40 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,269 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-8 to 35 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,269 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-9 to 40 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,269 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-1 to 38 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,269 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-4 to 40 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,270 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-6 to 35 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,270 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-7 to 40 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,270 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Resetting the last seen epoch of partition qa.queuing.PLIM.PRODUCT_STYLE_MASTER-3 to 40 since the associated topicId changed from null to FXePF4zxQtugcKm0Tbgjog
2023-01-31 14:31:05,272 INFO o.a.k.c.Metadata: [Producer clientId=producer-1] Cluster ID: lkc-1jywz
2023-01-31 14:31:05,272 INFO o.a.k.c.p.i.TransactionManager: [Producer clientId=producer-1] ProducerId set to 13702119 with epoch 0
2023-01-31 14:31:06,528 INFO o.a.j.t.JMeterThread: Thread is done: Iterator - Thread Group 2-1
2023-01-31 14:31:06,528 INFO o.a.j.t.JMeterThread: Thread finished: Iterator - Thread Group 2-1
2023-01-31 14:31:06,528 INFO o.a.j.t.JMeterThread: Thread is done: Iterator - Thread Group 2-2
2023-01-31 14:31:06,528 INFO o.a.j.t.JMeterThread: Thread finished: Iterator - Thread Group 2-2
2023-01-31 14:31:06,528 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2023-01-31 14:31:06,528 INFO o.a.j.e.StandardJMeterEngine: Starting tearDown thread groups
2023-01-31 14:31:06,528 INFO o.a.j.e.StandardJMeterEngine: Starting tearDown ThreadGroup: 1 : tearDown Thread Group
2023-01-31 14:31:06,528 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group tearDown Thread Group.
2023-01-31 14:31:06,528 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-01-31 14:31:06,528 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2023-01-31 14:31:06,529 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2023-01-31 14:31:06,529 INFO o.a.j.t.JMeterThread: Thread started: tearDown Thread Group 1-1
2023-01-31 14:31:06,537 INFO o.a.k.c.p.KafkaProducer: [Producer clientId=producer-1] Closing the Kafka producer with timeoutMillis = 9223372036854775807 ms.
2023-01-31 14:31:08,749 INFO o.a.k.c.m.Metrics: Metrics scheduler closed
2023-01-31 14:31:08,749 INFO o.a.k.c.m.Metrics: Closing reporter org.apache.kafka.common.metrics.JmxReporter
2023-01-31 14:31:08,749 INFO o.a.k.c.m.Metrics: Metrics reporters closed
2023-01-31 14:31:08,750 INFO o.a.k.c.u.AppInfoParser: App info kafka.producer for producer-1 unregistered
2023-01-31 14:31:08,750 INFO o.a.j.p.j.s.J.Close Connection - PRODUCT_STYLE_MASTER: Producer closed
2023-01-31 14:31:08,751 INFO o.a.j.t.JMeterThread: Thread is done: tearDown Thread Group 1-1
2023-01-31 14:31:08,751 INFO o.a.j.t.JMeterThread: Thread finished: tearDown Thread Group 1-1
2023-01-31 14:31:08,751 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2023-01-31 14:31:08,751 INFO o.a.j.v.b.BackendListener: Worker ended
2023-01-31 14:31:08,751 INFO r.n.a.j.JMeterInfluxDBBackendListenerClient: Shutting down influxDB scheduler...
2023-01-31 14:31:08,759 INFO r.n.a.j.JMeterInfluxDBBackendListenerClient: influxDB scheduler terminated!
2023-01-31 14:31:08,760 INFO o.a.j.r.Summariser: summary +      3 in 00:00:06 =    0.5/s Avg:  3092 Min:  2221 Max:  3781 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2023-01-31 14:31:08,760 INFO o.a.j.r.Summariser: summary =      4 in 00:00:07 =    0.6/s Avg:  2452 Min:   533 Max:  3781 Err:     0 (0.00%)